PC2_Parte3/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "abc"], ["rating", "3"], ["description", "abc"], ["release_date", nil], ["created_at", "2023-10-11 17:14:03.992913"], ["updated_at", "2023-10-11 17:14:03.992913"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "title" = ?, "rating" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Testing"], ["rating", ""], ["description", "Testing somehting..."], ["updated_at", "2023-10-11 17:21:06.439969"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_movie
      begin
        @movie = Movie.find(params[:id])