PC2_Parte2/app/controllers/movies_controller.rb

    def show
        id = params[:id]
        begin
          @movie = Movie.find(id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]